# Steps for Data Preprocessing

Steps:1 Importing libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

Steps:2 Importing datasets

In [3]:
dataset = pd.read_csv('Data.csv')

In [4]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [5]:
type(dataset)

pandas.core.frame.DataFrame

In [6]:
dataset.describe()

             Age        Salary
count   9.000000      9.000000
mean   38.777778  63777.777778
std     7.693793  12265.579662
min    27.000000  48000.000000
25%    35.000000  54000.000000
50%    38.000000  61000.000000
75%    44.000000  72000.000000
max    50.000000  83000.000000

In [7]:
dataset.isnull().any()

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool

In [8]:
dataset.isnull().any

<bound method DataFrame.any of    Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False>

In [9]:
dataset['Age'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: Age, dtype: bool

In [10]:
dataset['Age'].isnull().any()

True

In [11]:
dataset['Age'].isnull().any

<bound method Series.any of 0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
Name: Age, dtype: bool>

In [12]:
dataset['Salary'].isnull()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
7    False
8    False
9    False
Name: Salary, dtype: bool

Step: 3 Handling missing data
        a) Deleting those particular rows(containing null values)
        b) Finding the mean or mode of that particular column according to the type of data

In [ ]:
#Filling the null values of a column by finding mean of that column(valid only for numbers)

In [13]:
dataset['Age'].fillna((dataset['Age'].mean()),inplace = True)
dataset['Salary'].fillna((dataset['Salary'].mean()),inplace = True)

In [14]:
dataset

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

In [ ]:
#To round off the values

In [29]:
dataset['Age'] = dataset['Age'].round()

In [30]:
dataset

   Country   Age        Salary Purchased
0   France  44.0  72000.000000        No
1    Spain  27.0  48000.000000       Yes
2  Germany  30.0  54000.000000        No
3    Spain  38.0  61000.000000        No
4  Germany  40.0  63777.777778       Yes
5   France  35.0  58000.000000       Yes
6    Spain  39.0  52000.000000        No
7   France  48.0  79000.000000       Yes
8  Germany  50.0  83000.000000        No
9   France  37.0  67000.000000       Yes

In [ ]:
#To count the total numbers of items repeated

In [15]:
dataset['Country'].value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [16]:
dataset['Purchased'].value_counts()

Yes    5
No     5
Name: Purchased, dtype: int64

In [ ]:
#After filling the null values check if any null values is present or not

In [17]:
dataset.isnull().any()

Country      False
Age          False
Salary       False
Purchased    False
dtype: bool

Step: 4 Seperating independent variables and dependent variables in dataset

In [ ]:
#To convert pandas into numpy arrays(add values at last)

In [18]:
x = dataset.iloc[:,0:3].values
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [19]:
y = dataset.iloc[:,-1].values
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [20]:
#To check the dimesnison of the arrays x and y (use ndim)

In [21]:
x.ndim

2

In [22]:
y.ndim

1

In [ ]:
#We can have y in multi dimensions also

In [23]:
y = dataset.iloc[:,3:4].values
y

array([['No'],
       ['Yes'],
       ['No'],
       ['No'],
       ['Yes'],
       ['Yes'],
       ['No'],
       ['Yes'],
       ['No'],
       ['Yes']], dtype=object)

In [24]:
x

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [ ]:
#To check how many rows and colums are there in array

In [25]:
x.shape  #here(10, 3) means 10 rows and 3 columns

(10, 3)

In [26]:
y

array([['No'],
       ['Yes'],
       ['No'],
       ['No'],
       ['Yes'],
       ['Yes'],
       ['No'],
       ['Yes'],
       ['No'],
       ['Yes']], dtype=object)

In [27]:
y.shape

(10, 1)

Step: 5 Encoding categorical text variables

In [38]:
import sklearn

In [39]:
sklearn.__version__

'0.21.3'

In [40]:
!pip install scikit-learn==0.22.1

Requirement already satisfied: scikit-learn==0.22.1 in c:\users\hp\anaconda3\lib\site-packages (0.22.1)
Requirement already satisfied: numpy>=1.11.0 in c:\users\hp\anaconda3\lib\site-packages (from scikit-learn==0.22.1) (1.16.5)
Requirement already satisfied: joblib>=0.11 in c:\users\hp\anaconda3\lib\site-packages (from scikit-learn==0.22.1) (0.13.2)
Requirement already satisfied: scipy>=0.17.0 in c:\users\hp\anaconda3\lib\site-packages (from scikit-learn==0.22.1) (1.3.1)